["Christie Brinkley once swam through the Waco, TX sewer system just to see Chuck Norris' ass.","Go to Joke #51, for this joke. This was hacked by Chuck Norris.","the only thing what can beat Chuck Norris is his MOM","Chuck Norris was born at the speed of sound into the forehead of a Nazi.","If you can read this, your gonna die from Chuck Norris.","Chuck Norris is a proud sponsor of death!","Chuck Norris drinks carrots by themselves in a way I will not tell you. All that I will say is that he sometimes drinks carrot juice instead.","The real reason why the Titanic sunk was because Chuck Norris was swimming under water and crashed into the Titanic by accident.","Chuck Norris doesn't get shocked, the electricity gets Chuck Norris'd","Making eye contact with Chuck Norris is a great way to get your spine removed","Chuck Norris can make a mole hill out of a mountain.","Chuck Norris employs a concierge urologist.","In the late 1800's Chuck Norris' nickname was \"Polio\". And the reason for that nickname was not sloely because he has iron lungs.","When Chuck Norris sends you a poke on Facebook, it kills you.","Jack in the Box's do not work around Chuck Norris. They know better than to attempt to scare Chuck Norris","Chuck Norris can kill Liberty Prime in one hit with a BB Gun.","Chuck Norris ate Hannibal Lecter`s liver. With some fava beans, and a nice keg of beer.","Chuck Norris is God's secret cousin","Fifty Shades Of Grey was originally about Chuck Norris' back hair.","Chuck Norris can draw a perfect circle with a ruler.","Einstein's Theory of Relativity states that nothing can travel faster than light... except Chuck Norris's roundhouse kick.","Before boarding a plane, Chuck Norris personally frisks all TSA agents, pilots, flight crews, baggage handlers, air traffic controllers and passengers. So far Chuck Norris has not discovered any terrorists but has found 3 enlarged prostates, 36 breast implants, one glass eye, 7 pints of whiskey and a gerbil.","Chuck Norris once paddled the shit out of Ronald McDonald with his own shoes. He later commented \"Anyone who wears stupid big red shoes like that is a fucking clown.\"","On May 3, 1999, Chuck Norris was looking on a map for the quickest route to Oklahoma City and drew a path across Moore, OK with his finger. Moore was destroyed. He did it again on May 20, 2013.","Chuck Norris's shadow weighs 250 pounds and can kick your ass .","Chuck Norris can kick you in the nuts so hard, they will fly through your body up into your head and knock out your eyeballs, effectively replacing them.","Chuck Norris can smoke a whole bush of ganja without getting stoned.","Best. Weapon. Against. Zombie. Apocalypse?! Chuck Norris.","Chuck Norris can eat just one Lay's potato chip.","Chuck Norris never asks you to 'step outside', he actually wants as many people to witness your brutal slaughter as possible.","One time Chuck Norris stared a man to death.","He who lives by the sword, dies by the sword. He who lives by Chuck Norris, dies by the roundhouse kick.","It's been discovered that the best possible weapon to have when the zombies come is Chuck Norris.","It's a little known fact that Chuck Norris's cat had a part in Harry Potter. To conceal her identity they called her \" Mrs Norris\".","Gorillas engage in fights only after making sure Chuck Norris is not watching them stealthly.","Chuck Norris does not forget his friends and loved ones birthdays. He decides when their birthdays are.","When Chuck Norris ironed his clothes the steam was blood","If you're a horse, here's a little advice: Never look a gift CHUCK NORRIS in the mouth!","The Death Star's original name was Space Station Chuck Norris.","Chuck Norris isn't gay, He's beyond gay.","Black-eyed peas were normal peas before Chuck Norris decided he didn't like peas.","Chuck Norris gave the terminators the emotion \"fear\"","Chuck Norris is too legit to quit.","In the filming of \"The Way Of The Dragon\", Chuck Norris was heavilly bribed to lose to Bruce Lee.","Chuck Norris Don't Need To Eat, He Will Find You.","Chuck Norris won the Daytona 500 in a Barbie Jeep.","Chuck Norris is the real Mission Impossible.","Chuck Norris is what willis was talkin bout","Chuck Norris is the best American Sniper by far. He once made an 1,800 yard kill shot in the mountains of Afghanistan using only his trusty Donald Duck PEZ dispenser.","Chuck Norris' blood type is DOA Fucking Negative.","Only Chuck Norris can prevent forest fires, but he really likes gigantic toasted marshmallows.","After sex, Chuck Norris doesn't 'spoon' with his ladies. He knifes them.","Chuck Norris is the only man to ever defeat a brick wall in a game of tennis.","Chuck Norris invented the Shotgun Enema.","Chuck Norris doesn't take the front door. He takes the front wall as his entrance.","CHUCK NORRIS IS THE REASON HITLER KILLED HIMSELF. HE KNEW HE COULD NOT TAKE OVER THE WORLD WITH HIM STILL IN IT. NOBODY CAN TELL CHUCK WAT TO DO.","CHUCK NORRIS IS BIGGER THAN GODZILLA","Chuck Norris can take a selfie with both hands tied behind his back","Jack Bauer needs 24 hours to save the day. Chuck Norris needs 24 minutes.","Chuck Norris requires both arms and legs to masturbate.","When Chuck Norris had surgery, the anesthesia was applied to the doctors.","Chuck Norris doesn't pair program.","Every convicted killer in the history of the world has been innocent. They were all just covering for Chuck Norris.","IF CHUCK NORRIS GIVES YOU A ROUND HOUSE KICK IN YOUR DREAMS YOU REALY DIE","Little-known fact: Lionel Richie wrote 'Dancing On The Ceiling' about the time he attended a Chuck Norris party where he reversed the gravity at his house for the night.","Bruce Spingsteen calls Chuck Norris \"The Boss\".","Why did the chicken cross the road? To get to Chuck Norris's side.","Chuck Norris famously once said: \"With great power comes great responsibility. But sometimes, y'know, fuck it.\"","Chuck Norris once round-house kicked a man in a call centre. Over the phone.","Chuck Norris' balls make cold water shrink.","Chuck Norris can drink water in a saucer.","Chuck Norris got into a fight with himself... and won","Chuck Norris can drive two cars at the same time!!","Chuck Norris once got a woman pregnant. And then he had sex with her.","In the semen that made it to Chuck Norris' mom's womb, Chuck Norris was the only sperm. He'd long then round-house killed all the other sperms while still in his Dad's epididymis/balls.","In a paper due out soon, Stephen Hawking has proven that Chuck Norris exists in every universe, multiverse, and every dimension. There is no escaping Chuck Norris.","NASA ended the space shuttle program when they discovered it'd be easier and cheaper to have Chuck Norris launch astronauts into space.","Chuck Norris walked in a chinese restaurant and asked for Chicken Parmesan with Bruschetta bread...and got it.","Chuck Norris can dribble a bowling ball.","Chuck Norris can lick his eyebrows and breathe through his ears. That's why the ladies love him so much.","Chuck Norris dosn't dip oreos in milk, Chuck Norris dips glasses of milk in oreos.","a king cobra once bit Chuck Norris... after 5 days of terrible pain... the snake died","In a fight between Batman and Darth Vader, the winner would be Chuck Norris.","Chuck Norris can hover up-side-down in a jet-pack.","If Chuck Norris says to you \"Truth or dare?\", he's not playing the game...","If you ever make the mistake of going up to Chuck Norris and saying 'what's up?', don't be surprised when he says 'you, asshole' and uppercuts you into the lower ionosphere.","Jesus can walk on water, but Chuck Norris can swim through land!","Unlike Santa Claus, Chuck Norris doesn't need to check his list twice.","when Chuck Norris pours milk into his rice crispy's they shut the fuck up","Chuck Norris wrote half of \"War and Peace\" in a day. Guess which half.","Chuck Norris thinks inside the bun","The thing worst than Chuck Norris is death...wait...I got it backwards.","Chuck Norris demanded he be awarded a Nobel Prize or else he would destroy the world. To appease the great destroyer, the Nobel Committee awarded the Nobel Peace Prize for 1947 to Chuck Norris and Gandhi. Chuck Norris killed Gandhi the next day.","When Chuck Norris was in high school he played baseball. He did not use a bat, he just used his fist to punch the ball out of the park.","Chuck Norris can pick an apple out of a basket full of oranges","When Chuck Norris does a pushup, he isn't lifting himself up, he's pushing the Earth down.","Chuck Norris is so modest that his ranch isn't called \"Chuck Norris's ranch.\" It is simply called \"Texas\".","Chuck Norris is the only co-star he can work with.","When James Cameron reached the deepest point on Earth at Mariana Trench, he saw no signs of life there except for some tiny shrimp-like creatures and Chuck Norris meditating on the ocean floor.","When Chuck Norris uses a bow and arrow, the ghost of Robin Hood appears with a notebook","The reason why we have night time is because Chuck Norris commands the sun to go to sleep."]